# 1) Найдите остаток от деления 77 на 2
print(77 % 2)


# 2) Узнайте четное ли число 22
print(22 % 2)

# 3) Посчитайте 86 в степени 7
print(86 ** 7)

# 4) Найдите квадратный корень из 3686400
print(int(3686400 ** 0.5))